Repository: aryansharma1305/Mental-Heath-App
Catalog: lib/l10n/app_*.arb
Languages: hi, ta

# appTitle
source: MindCare
hi: மைண்ட் கேர்
ta: மைண்ட் கேர்

# doctorWelcome
source: Welcome, Doctor
hi: नमस्ते, डॉक्टर
ta: வணக்கம், மருத்துவர்

# patientInfo
source: Patient Information
hi: रोगी की जानकारी
ta: நோயாளி தகவல்

source: Start Assessment
hi: मूल्यांकन शुरू करें
ta: மதிப்பீட்டைத் தொடங்கவும்

# dsm5Title
source: DSM-5 Assessment
hi: DSM-5 मूल्यांकन
ta: DSM-5 மதிப்பீடு

# dsm5Subtitle
source: Cross-Cutting Symptom Measure
hi: क्रॉस-कटिंग लक्षण उपाय
ta: குறுக்கு வெட்டு அறிகுறி அளவீடு

# anonymisedId
source: Anonymised Patient ID
hi: अज्ञात रोगी आईडी
ta: அடையாளம் மறைக்கப்பட்ட நோயாளி ஐடி

# enterIdHint
source: Enter anonymous ID (no names)
hi: आईडी दर्ज करें (कोई नाम नहीं)
ta: ஐடியை உள்ளிடவும் (பெயர்கள் இல்லை)

source: Recent Activity
hi: हाल की गतिविधि
ta: சமீபத்திய செயல்பாடு

source: New Assessment
hi: नया मूल्यांकन
ta: புதிய மதிப்பீடு

source: View All
hi: सभी देखें
ta: அனைத்தையும் பார்

source: Home
hi: होम
ta: முகப்பு

source: Profile
hi: प्रोफाइल
ta: விவரக்குறிப்பு

# assessmentTitle
source: DSM-5 Assessment
hi: DSM-5 मूल्यांकन
ta: DSM-5 மதிப்பீடு

# assessmentSubtitle
source: Cross-Cutting Symptom Measure
hi: क्रॉस-कटिंग लक्षण उपाय
ta: குறுக்கு வெட்டு அறிகுறி அளவீடு

# patientInfoTitle
source: Patient Information
hi: रोगी की जानकारी
ta: நோயாளி தகவல்

# patientInfoSubtitle
source: Enter details to begin
hi: शुरू करने के लिए विवरण दर्ज करें
ta: தொடங்க விவரங்களை உள்ளிடவும்

# enterIdLabel
source: Anonymised Patient ID
hi: अज्ञात रोगी आईडी
ta: அடையாளம் மறைக்கப்பட்ட நோயாளி ஐடி

# dsm5Info
source: DSM-5 Cross-Cutting Measure: 23 questions across 13 psychiatric domains
hi: DSM-5 क्रॉस-कटिंग उपाय: 13 मनोरोग डोमेन में 23 प्रश्न
ta: DSM-5 குறுக்கு வெட்டு அளவீடு: 13 உளவியல் களங்களில் 23 கேள்விகள்

# pastTwoWeeks
source: During the past TWO (2) WEEKS, how much have you been bothered by:
hi: पिछले दो (2) सप्ताहों के दौरान, आप कितना परेशान रहे हैं:
ta: கடந்த இரண்டு (2) வாரங்களில், நீங்கள் எவ்வளவு பாதிக்கப்பட்டீர்கள்:

source: Previous
hi: पिछला
ta: முந்தைய

source: Done
hi: हो गया
ta: முடிந்தது

# newAssessmentButton
source: New
hi: नया
ta: புதிய

source: Assessment Complete
hi: मूल्यांकन पूरा हुआ
ta: மதிப்பீடு முடிந்தது

# scoreLabel
source: Score
hi: स्कोर
ta: மதிப்பெண்

# level2Recommended
source: Level 2 Assessment Recommended
hi: स्तर 2 मूल्यांकन अनुशंसित
ta: நிலை 2 மதிப்பீடு பரிந்துரைக்கப்படுகிறது

source: Domain Breakdown
hi: डोमेन ब्रेकडाउन
ta: கள முறிவு

# criticalAlertTitle
source: Critical Alert
hi: गंभीर चेतावनी
ta: முக்கிய எச்சரிக்கை

# criticalAlertMessage
source: Patient has reported thoughts of self-harm. Immediate clinical assessment is recommended.
hi: रोगी ने आत्म-नुकसान के विचारों की सूचना दी है। तत्काल नैदानिक मूल्यांकन की सिफारिश की जाती है।
ta: நோயாளி தனக்குத்தானே தீங்கு விளைவிக்கும் எண்ணங்களைப் புகாரளித்துள்ளார். உடனடி மருத்துவ மதிப்பீடு பரிந்துரைக்கப்படுகிறது.

source: Error loading assessments
hi: मूल्यांकन लोड करने में त्रुटि
ta: மதிப்பீடுகளை ஏற்றுவதில் பிழை

source: Acknowledged
hi: स्वीकार किया
ta: ஏற்றுக்கொள்ளப்பட்டது

source: All Assessments
hi: सभी मूल्यांकन
ta: அனைத்து மதிப்பீடுகளும்

# searchHint
source: Search by patient name, ID, or assessor...
hi: रोगी का नाम, आईडी, या मूल्यांकनकर्ता द्वारा खोजें...
ta: பெயர், ஐடி அல்லது மதிப்பீட்டாளர் மூலம் தேடவும்...

source: No assessments found
hi: कोई मूल्यांकन नहीं मिला
ta: மதிப்பீடுகள் எதுவும் காணப்படவில்லை

source: No assessments yet
hi: अभी तक कोई मूल्यांकन नहीं
ta: இதுவரை மதிப்பீடுகள் இல்லை

# adjustSearchTerms
source: Try adjusting your search terms
hi: अपनी खोज शर्तों को समायोजित करने का प्रयास करें
ta: உங்கள் தேடல் சொற்களை மாற்ற முயற்சிக்கவும்

# createFirstAssessment
source: Create your first assessment
hi: अपना पहला मूल्यांकन बनाएं
ta: உங்கள் முதல் மதிப்பீட்டை உருவாக்கவும்

source: Sort by Date (Newest)
hi: दिनांक के अनुसार क्रमबद्ध करें (नवीनतम)
ta: தேதி அடிப்படையில் வரிசைப்படுத்து (புதியது)

source: Sort by Date (Oldest)
hi: दिनांक के अनुसार क्रमबद्ध करें (पुराना)
ta: தேதி அடிப்படையில் வரிசைப்படுத்து (பழையது)

source: Sort by Name (A-Z)
hi: नाम के अनुसार क्रमबद्ध करें (A-Z)
ta: பெயர் அடிப்படையில் வரிசைப்படுத்து (A-Z)

source: Sort by Name (Z-A)
hi: नाम के अनुसार क्रमबद्ध करें (Z-A)
ta: பெயர் அடிப்படையில் வரிசைப்படுத்து (Z-A)

# assessmentsCount
source: {count, plural, =1{1 assessment} other{{count} assessments}}
hi: {count, plural, =1{1 मूल्यांकन} other{{count} मूल्यांकन}}
ta: {count, plural, =1{1 மதிப்பீடு} other{{count} மதிப்பீடுகள்}}

# statusPending
source: Pending
hi: लंबित
ta: நிலுவையில்

# statusReviewed
source: Reviewed
hi: समीक्षा की गई
ta: மதிப்பாய்வு செய்யப்பட்டது

# statusCompleted
source: Completed
hi: पूरा हुआ
ta: முடிந்தது

# statusUnknown
source: Unknown
hi: अज्ञात
ta: தெரியாத

# capacityCapable
source: Has capacity for this decision
hi: इस निर्णय के लिए क्षमता है
ta: இந்த முடிவுக்கு திறன் உள்ளது

# capacityIncapable
source: Lacks capacity for this decision
hi: इस निर्णय के लिए क्षमता का अभाव है
ta: இந்த முடிவுக்கு திறன் இல்லை

# capacityFluctuating
source: Fluctuating capacity - reassessment needed
hi: उतार-चढ़ाव वाली क्षमता - पुनर्मूल्यांकन की आवश्यकता है
ta: மாறுபடும் திறன் - மறுமதிப்பீடு தேவை
